[
    {
        "name": "Thorin II 'Oakenshield'",
        "description": "eventually called King under the Mountain or Mountain King[1], was the son of Thráin II, the older brother of Frerin and Dís, the grandson of King Thrór and the uncle of Fíli and Kíli. Thorin was best known for his deeds as leader of a company that infiltrated the lost Kingdom under the Mountain to take it back from Smaug and for leading an alliance of Men, Dwarves, and Elves in the Battle of Five Armies.",
        "image_source": "https://static.wikia.nocookie.net/lotr/images/3/3f/ThorinBIG.jpg"
    },
    {
        "name": "Fíli and Kíli",
        "description": "Fíli and Kíli were brothers, the youngest of the thirteen Dwarves who set out with Thorin Oakenshield's company, along with Gandalf and Bilbo Baggins, to reclaim the Lonely Mountain from the dragon Smaug. Fíli and Kíli were the two most active Dwarves of Thorin's company, and, apart from Balin and possibly Bombur, they appear more frequently as 'individual' characters in J.R.R. Tolkien's The Hobbit than the rest of Thorin's companions, who are most often named only in group-reference.",
        "image_source": "https://static.wikia.nocookie.net/lotr/images/b/b4/The-Hobbit-Fili-and-Kili.jpg"
    },
    {
        "name": "Óin",
        "description": "Óin was the older brother of Glóin, cousin of Dwalin and Balin, and uncle of Gimli. Óin's uncle was Fundin, the father of Balin and Dwalin. Óin fought in the Battle of Azanulbizar along with Thorin Oakenshield, and in TA 2941 joined Thorin's company on the quest to reclaim the Lonely Mountain, wearing a brown hood. Óin was one of the Dwarves who bet that Bilbo would come along with them to reclaim the Lonely Mountain. Óin and his brother Glóin were usually in charge of preparing the fire for the Company, as they were the most skilled of the group. He fought in and survived the Battle of Five Armies, and later settled in the Lonely Mountain with King Dáin II Ironfoot, along with many other Dwarves of the company of Thorin.",
        "image_source": "https://static.wikia.nocookie.net/lotr/images/4/4b/Oinstaff.jpg"
    }
]